GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x7f0: file p2final.c, line 30.
(gdb) r
Starting program: /home/runner/IA1-Revision/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:30
30                          p=input();
(gdb) n
enter 3 numbers3
31                          q=input();
(gdb) 4
Undefined command: "4".  Try "help".
(gdb) n
enter 3 numbers4
32                          r=input();
(gdb) n
enter 3 numbers5
33                          s=cmp(p,q,r);
(gdb) n
34                          printf("%d\n",s);
(gdb) n
5
35                          return 0;
(gdb) n
36                          }(gdb) s
__libc_start_main (main=0x5583e82007e8 <main>, argc=1, argv=0x7fffe44a3c58, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7fffe44a3c48) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 471) exited normally]
(gdb) l
339 in ../csu/libc-start.c